EDTconf/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникКонтактныеЛица</name>
      <description>Контактная информация справочника &quot;Контактные лица&quot;</description>
    </items>
    <items>
      <name>СправочникЛичныеАдресаты</name>
      <description>Контактная информация справочника &quot;Личные адресаты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Справочник контрагенты</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Справочник физические лица</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресТолькоРоссийский</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDTconf/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

EDTconf/src/Catalogs/ВидыКонтактнойИнформации/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТипКИАдрес   = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ТипКИТелефон = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ТипКИФакс    = Перечисления.ТипыКонтактнойИнформации.Факс;
	ПроверитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи()
	
	ПроверитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	ПроверитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеТолькоВДиалогеПриИзменении(Элемент)
	
	ПроверитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьЭлементыФормы(Форма)
	
	ЭтоНовый = Не ЗначениеЗаполнено(Форма.Объект.Ссылка);
	
	Если ЭтоНовый Тогда
		// для новых видов КИ установим признак "Можно изменять способ редактирования"
		Форма.Объект.МожноИзменятьСпособРедактирования = Истина;
		
	Иначе
		// для уже записанных запретим редактировать группу и тип
		Форма.Элементы.Родитель.ТолькоПросмотр = Истина;
		Форма.Элементы.Тип.ТолькоПросмотр      = Не Форма.РазрешитьРедактированиеТипа;
		
		// для предопределенных запретим и наименование редактировать
		Если Форма.Объект.Предопределенный Тогда
			Форма.Элементы.Наименование.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Форма.Объект.МожноИзменятьСпособРедактирования Тогда
		// Если у объекта нельзя менять способ редактирования, то сделаем недоступными оставшиеся элементы
		Форма.Элементы.РедактированиеТолькоВДиалоге.Доступность = Ложь;
		Форма.Элементы.АдресТолькоРоссийский.Доступность = Ложь;
		Возврат;
	
	КонецЕсли;
	
	ЭтоАдрес   = (Форма.Объект.Тип = Форма.ТипКИАдрес);
	ЭтоТелефон = (Форма.Объект.Тип = Форма.ТипКИТелефон);
	ЭтоФакс    = (Форма.Объект.Тип = Форма.ТипКИФакс);
	НеЗаполненТип = Не ЗначениеЗаполнено(Форма.Объект.Тип);
	
	// Установим доступность и проверим значение поля РедактированиеТолькоВДиалоге
	Если ЭтоАдрес ИЛИ ЭтоТелефон ИЛИ ЭтоФакс ИЛИ НеЗаполненТип Тогда
		Форма.Элементы.РедактированиеТолькоВДиалоге.Доступность = Истина;
	Иначе
		Форма.Элементы.РедактированиеТолькоВДиалоге.Доступность = Ложь;
		Если Форма.Объект.РедактированиеТолькоВДиалоге Тогда
			Форма.Объект.РедактированиеТолькоВДиалоге = Ложь;
		КонецЕсли;
	КонецЕсли;
		
	// Установим доступность и проверим значение поля РедактированиеТолькоВДиалоге
	Если ЭтоАдрес И Форма.Объект.РедактированиеТолькоВДиалоге Тогда
		Форма.Элементы.АдресТолькоРоссийский.Доступность = Истина;
	Иначе
		Форма.Элементы.АдресТолькоРоссийский.Доступность = Ложь;
		Если Форма.Объект.АдресТолькоРоссийский Тогда
			Форма.Объект.АдресТолькоРоссийский = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РазрешитьРедактированиеТипаПриИзменении(Элемент)
	ПроверитьЭлементыФормы(ЭтотОбъект);
КонецПроцедуры
